[{"fields": {"titulo": "1. Introducción a la computadora personal", "objetivo": "Una computadora es una máquina electrónica que realiza cálculos a partir de un conjunto de instrucciones. Las primeras computadoras eran máquinas inmensas del tamaño de una habitación, cuyo armado, administración y mantenimiento requerían de equipos de personas. Los sistemas de computación de la actualidad son exponencialmente más rápidos, y su tamaño es de apenas una fracción del de aquellas primeras computadoras.\r\n\r\nUn sistema de computación consta de componentes de hardware y software. El hardware es el equipo físico. Este incluye el gabinete, las unidades de almacenamiento, los teclados, los monitores, los cables, los altavoces y las impresoras. El software incluye el sistema operativo y los programas. El sistema operativo administra los recursos de hardware de la PC y ofrece servicios comunes para los programas de la PC. Estas operaciones pueden incluir la identificación y el procesamiento de información, así como el acceso a esta. Los programas o aplicaciones se encargan de distintas funciones. Los programas varían ampliamente según el tipo de información a la que se accede o que se genera. Por ejemplo, las instrucciones para reconciliar una chequera difieren de las instrucciones para simular un mundo de realidad virtual en Internet."}, "model": "academia.capitulo", "pk": 1}, {"fields": {"titulo": "2. Procedimientos de laboratorio y uso de herramientas", "objetivo": "Este capítulo abarca las prácticas básicas de seguridad para el lugar de trabajo, las herramientas de hardware y software, y la eliminación de materiales peligrosos. Las pautas de seguridad ayudan a prevenir accidentes personales y lesiones, y también ayudan a proteger los equipos de daños. \r\n\r\nAlgunas de estas pautas están diseñadas para proteger al medio ambiente de la contaminación que provoca la eliminación incorrecta de materiales."}, "model": "academia.capitulo", "pk": 2}, {"fields": {"titulo": "3. Armado de PC", "objetivo": "El armado de PC constituye gran parte del trabajo de un técnico. Como técnico, al trabajar con componentes de PC, debe hacerlo de forma lógica y metódica. En ocasiones, es posible que deba determinar si se debe actualizar o reemplazar un componente de la PC de un cliente. Es importante que desarrolle aptitudes avanzadas en los procesos de instalación, las técnicas de resolución de problemas y los métodos de diagnóstico. En este capítulo, se analiza la importancia de la compatibilidad de los componentes con el hardware y el software. También se abarca la necesidad de los recursos del sistema adecuados para ejecutar el hardware y el software del cliente de manera eficaz."}, "model": "academia.capitulo", "pk": 3}, {"fields": {"titulo": "4. Descripción general del mantenimiento preventivo", "objetivo": "\r\n\r\nEl mantenimiento preventivo es la inspección, la limpieza y el reemplazo periódicos y sistemáticos de partes y materiales desgastados y sistemas. Un mantenimiento preventivo eficaz reduce las fallas de partes, materiales y sistemas, y mantiene el hardware y el software en buenas condiciones de funcionamiento.\r\n\r\nLa resolución de problemas es el proceso sistemático utilizado para localizar la causa de una falla en un sistema de computación y corregir los problemas de hardware y software pertinentes.\r\n\r\nEn este capítulo, aprenderá pautas generales para la creación de programas de mantenimiento preventivo y procedimientos de resolución de problemas. Estas pautas constituyen un punto de partida para ayudarlo a desarrollar aptitudes de mantenimiento preventivo y resolución de problemas."}, "model": "academia.capitulo", "pk": 4}, {"fields": {"titulo": "5. Sistemas operativos", "objetivo": "El sistema operativo (OS, operating system) controla casi todas las funciones en una PC. En este capítulo, aprenderá sobre los componentes, las funciones y la terminología relacionada con los sistemas operativos Windows 7, Windows Vista y Windows XP. "}, "model": "academia.capitulo", "pk": 5}, {"fields": {"titulo": "6. Redes", "objetivo": "En este capítulo, se brinda una descripción general de los principios, estándares y propósitos de las redes.\r\n\r\nSe analizan los distintos tipos de topologías, protocolos y modelos lógicos de red, y el hardware necesario para crear una red. Además, en este capítulo se abarcan las actualizaciones de componentes de red, las instalaciones y la configuración de servidores de correo electrónico, la resolución de problemas y el mantenimiento preventivo. También ofrece conocimientos sobre software de red, métodos de comunicación y relaciones de hardware.\r\n\r\nPara cumplir con las expectativas y las necesidades de los clientes y los usuarios de red, debe estar familiarizado con las tecnologías de networking. Este capítulo proporciona conocimientos básicos sobre diseño de red y sobre la manera en que algunos componentes afectan el flujo de datos en una red. Estos conocimientos lo ayudarán a resolver problemas de red correctamente."}, "model": "academia.capitulo", "pk": 6}, {"fields": {"titulo": "7. Computadoras portátiles", "objetivo": "Las primeras computadoras portátiles eran utilizadas principalmente por empresarios que necesitaban introducir datos y acceder a ellos mientras estaban fuera de la oficina. El uso de las computadoras portátiles era limitado por su costo, peso y capacidades limitadas, en comparación con las computadoras de escritorio, que eran menos costosas.\r\n\r\nLa característica más significativa de las computadoras portátiles es su tamaño compacto. El diseño de la computadora portátil reúne teclado, pantalla y componentes internos en un pequeño gabinete portátil. Por consiguiente, las computadoras portátiles pueden utilizarse para tomar apuntes en entornos educativos, presentar información en reuniones de negocios o acceder a Internet en una cafetería. Su batería recargable permite el funcionamiento de las computadoras portátiles incluso cuando están desconectadas de una fuente de energía externa. Las computadoras portátiles deben su popularidad a su diseño compacto, practicidad y tecnología en constante evolución."}, "model": "academia.capitulo", "pk": 7}, {"fields": {"titulo": "8. Dispositivos móviles", "objetivo": "Debido al aumento de la demanda de movilidad, los dispositivos móviles cada vez adquieren más popularidad. Se considera dispositivo móvil a todo aquel que sea portátil, liviano y, en general, que utilice una pantalla táctil para la entrada de datos. Al igual que las computadoras portátiles o de escritorio, los dispositivos móviles utilizan un sistema operativo para ejecutar aplicaciones y juegos y para reproducir películas y música. Algunos ejemplos de dispositivos móviles son los dispositivos Android, como la tablet PC Samsung Galaxy y el smartphone Galaxy Nexus de Samsung; así como también el iPad y el iPhone de Apple.\r\n\r\nPara facilitar la movilidad, estos dispositivos utilizan diversas tecnologías inalámbricas. Muchos componentes, sistemas operativos y softwares de dispositivos móviles son exclusivos. Es importante familiarizarse con la mayor cantidad posible de dispositivos móviles diferentes.\r\n\r\nPosiblemente necesite saber cómo configurar diversos dispositivos móviles y cómo realizar tareas de reparación y mantenimiento. Parte del conocimiento adquirido sobre las computadoras portátiles y de escritorio será de utilidad. Sin embargo, existen diferencias considerables entre estas tecnologías.\r\n\r\nEl dominio de las habilidades necesarias para trabajar con dispositivos móviles es importante para avanzar profesionalmente. En este capítulo, se analizan las diversas características y las capacidades de los dispositivos móviles, incluidas la configuración, la sincronización y la realización de copias de seguridad de los datos."}, "model": "academia.capitulo", "pk": 8}, {"fields": {"titulo": "9. Impresoras", "objetivo": "En este capítulo, se proporciona información básica acerca de las impresoras. Aprenderá cómo funcionan las impresoras, qué debe tener en cuenta a la hora de adquirir una y cómo conectarlas a una PC individual o a una red.\r\n\r\nLas impresoras producen copias impresas de archivos electrónicos. Muchas normas gubernamentales requieren registros físicos, por lo que las copias impresas de los documentos digitales hoy en día son tan importantes como lo eran hace varios años atrás, cuando comenzó la revolución de la ausencia de papel.\r\n\r\nDebe comprender el funcionamiento de distintos tipos de impresoras para poder instalarlas y realizar tareas de mantenimiento en ellas, así como resolver cualquier tipo de problema que pueda surgir"}, "model": "academia.capitulo", "pk": 9}, {"fields": {"titulo": "10. Seguridad", "objetivo": "La seguridad informática y de red ayuda a asegurar que solo el personal autorizado tenga acceso a los dispositivos. También ayuda a mantener el funcionamiento correcto de los datos y el equipo. Las amenazas a la seguridad pueden ser internas o externas, es decir, pueden provenir del interior o el exterior de una organización, y el nivel de daño posible puede variar enormemente.\r\n\r\nLas responsabilidades principales de un técnico incluyen la seguridad de los datos y la red. El cliente o la organización pueden depender de usted para asegurar que los datos y los equipos de computación estén protegidos. Es posible que deba realizar tareas más delicadas que las que se le asignan al empleado común. Es posible que repare, configure e instale equipos. Necesita saber cómo realizar las configuraciones para proteger la red y, al mismo tiempo, mantenerla disponible para los que necesitan acceder a ella. Debe asegurarse de que se apliquen parches y actualizaciones de software, de que se instale software antivirus y de que se utilice software antispyware. También le pueden solicitar que instruya a los usuarios sobre cómo mantener buenas prácticas de seguridad en los equipos de computación.\r\n\r\nEn este capítulo, se revisan los tipos de ataques que amenazan la seguridad de las PC y de los datos que contienen. Los técnicos son responsables de la seguridad de los datos y los equipos de computación de una organización. En este capítulo, se describe cómo puede trabajar con los clientes para asegurarse de que se aplique la mejor protección posible."}, "model": "academia.capitulo", "pk": 10}, {"fields": {"titulo": "11. El profesional de TI", "objetivo": "Cualquier persona puede adquirir el conocimiento técnico requerido para trabajar en la industria de TI. Sin embargo, hace falta más que conocimiento técnico para convertirse en un profesional de TI exitoso. Los profesionales de TI deben estar familiarizados con las cuestiones legales y éticas que son inherentes a esta industria. Hay cuestiones de privacidad y confidencialidad que se deben tener en cuenta durante cada interacción con el cliente, ya sea en el campo, en la oficina o por teléfono en un centro de atención telefónica. Si se convierte en técnico en reparación y mantenimiento, aunque es posible que no interactúe directamente con los clientes, tendrá acceso a sus datos privados y confidenciales. En este capítulo, se analizan algunas cuestiones legales y éticas comunes.\r\n\r\nLos técnicos de los centros de atención telefónica trabajan exclusivamente por teléfono con los clientes. En este capítulo, se describen los procedimientos generales de los centros de atención telefónica y el proceso de trabajo con clientes.\r\n\r\nComo profesional de TI, deberá llevar a cabo la resolución de problemas y la reparación de PC, además de comunicarse con clientes y colegas frecuentemente. De hecho, la resolución de problemas tiene tanto que ver con saber comunicarse con los clientes como con saber reparar PC. Es este capítulo, aprenderá a utilizar buenas aptitudes para la comunicación con tanta confianza como utiliza un destornillador."}, "model": "academia.capitulo", "pk": 11}, {"fields": {"titulo": "12. Resolución avanzada de problemas", "objetivo": "Durante la carrera de técnico, es importante que desarrolle aptitudes avanzadas para la aplicación de técnicas de resolución de problemas y métodos de diagnóstico de componentes de PC, sistemas operativos, redes, computadoras portátiles, impresoras y problemas de seguridad. En ocasiones, la resolución de problemas avanzada significa que el problema es único o que la solución es difícil de implementar. Por lo general, se utiliza la resolución de problemas avanzada cuando la causa probable es difícil de diagnosticar.\r\n\r\nLa resolución de problemas avanzada consta no solo del uso de aptitudes para el diagnóstico avanzado al trabajar con hardware y software, sino además de la interacción entre técnicos y clientes, u otros técnicos. La forma en la que trabaja con clientes y con otros técnicos puede determinar qué tan rápida e integralmente se diagnostica y resuelve el problema. Aproveche los recursos, la interacción con otros técnicos y la comunidad de técnicos en línea para obtener respuestas a los desafíos de diagnóstico que se le presentan. Es posible que pueda ayudar a otro técnico a resolver un problema."}, "model": "academia.capitulo", "pk": 12}, {"fields": {"descripcion": "Presentación en PDF del capítulo 1", "url": "http://bit.ly/1xIYocE", "fecha": "2015-04-19", "capitulo": 1}, "model": "academia.recurso", "pk": 1}, {"fields": {"descripcion": "Presentación en PDF del capítulo 3", "url": "http://bit.ly/18Oxb1Z", "fecha": "2015-04-19", "capitulo": 3}, "model": "academia.recurso", "pk": 2}, {"fields": {"descripcion": "Simulador CISCO para el armado de una PC", "url": "www.simulador-cisco.hol.es", "fecha": "2015-04-19", "capitulo": 3}, "model": "academia.recurso", "pk": 3}, {"fields": {"descripcion": "Presentación en PDF del capítulo 4", "url": "http://bit.ly/1MWHm1x", "fecha": "2015-04-19", "capitulo": 4}, "model": "academia.recurso", "pk": 4}, {"fields": {"descripcion": "Presentación en PDF del capítulo 5", "url": "http://bit.ly/1C7Zt2T", "fecha": "2015-04-19", "capitulo": 5}, "model": "academia.recurso", "pk": 5}, {"fields": {"descripcion": "Presentación en PDF del capítulo 6", "url": "http://bit.ly/1HdZUvQ", "fecha": "2015-04-19", "capitulo": 6}, "model": "academia.recurso", "pk": 6}, {"fields": {"nombre": "admin", "email": "jsc.py.14@gmail.com"}, "model": "academia.usuario", "pk": 1}, {"fields": {"nombre": "usuario", "email": "user@email.com"}, "model": "academia.usuario", "pk": 2}, {"fields": {"encabezado": "AVISO IMPORTANTE", "cuerpo": "Buen día, a los alumnos del academia que asisten los días** miércoles de 11 a 1** se les informa lo siguiente:\r\n\r\n- El día ** 29 de Abril** del año en curso se suspenden la clases.\r\n\r\nPor tal motivo se reanudara el día **6 de Mayo.** \r\n\r\nSi existen algún cambio se les informara por este medio.\r\n\r\nQue pasen un excelente día.", "fecha": "2015-04-26", "usuario": 1}, "model": "academia.post", "pk": 2}]